catppuccin-cursors-mocha
catppuccin-sddm-theme-mocha
cava
cava-debug
cmake-init
conan
docker-desktop
docker-desktop-debug
eww
eww-debug
flatseal
lazydocker
lazydocker-debug
libcava-debug
nnn-nerd-debug
nvimpager
python-patch-ng
python-pluginbase
rate-mirrors
rate-mirrors-debug
rose-pine-cursor
rose-pine-hyprcursor
safeeyes
sfp-ui-bin
thinkfan
thinkfan-debug
ttf-ms-fonts
yay
yay-debug
