botan2
catppuccin-sddm-theme-mocha
conan
cppman
cppreference
dict-freedict-deu-eng-bin
dict-freedict-eng-deu-bin
docs-gl
gf2-git
gnu-netcat
goldendict-ng
goldendict-ng-debug
jdtls
libeb
libeb-debug
opencv-docs
python-croniter
python-pluginbase
rate-mirrors-debug
rose-pine-hyprcursor
thinkfan-debug
weylus-bin-debug
yay-debug
