7zip
a52dec
aalib
abseil-cpp
accounts-qml-module
accountsservice
acl
adobe-source-code-pro-fonts
adwaita-cursors
adwaita-icon-theme
adwaita-icon-theme-legacy
aha
alsa-card-profiles
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
alsa-utils
amd-ucode
ansible
ansible-core
aom
appstream
appstream-qt
aquamarine
archlinux-appstream-data
archlinux-keyring
argon2
aribb24
aspnet-runtime
at-spi2-core
atkmm
attica
attr
audit
autoconf
automake
avahi
avisynthplus
baloo
base
base-devel
bash
bash-completion
bat
bc
binutils
bison
bluedevil
blueman
bluez
bluez-libs
bluez-qt
bluez-utils
bolt
boost
boost-libs
botan2
breeze
breeze-gtk
breeze-icons
breeze-plymouth
brightnessctl
brotli
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cabextract
cairo
cairomm
cantarell-fonts
ccache
cdparanoia
chromaprint
chrony
cifs-utils
clang
clinfo
clucene
cmake
code
codec2
compiler-rt
composefs
convertlit
coreutils
cppdap
cronie
cryptsetup
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-glib
dbus-units
dconf
ddcutil
debugedit
default-cursors
desktop-file-utils
device-mapper
diffutils
discount
discover
dmidecode
dotnet-host
dotnet-runtime
dotnet-sdk
dotnet-targeting-pack
double-conversion
drkonqi
duktape
e2fsprogs
ebook-tools
editorconfig-core-c
efibootmgr
efivar
egl-gbm
egl-wayland
egl-x11
eglexternalplatform
electron32
enchant
ethtool
exiv2
exo
expat
faac
faad2
fakeroot
fastfetch
fcitx5
fcitx5-bamboo
fcitx5-configtool
fcitx5-gtk
fcitx5-qt
ffmpeg
ffmpeg4.4
fftw
file
filesystem
findutils
firefox
flac
flatpak
flatpak-kcm
flex
fluidsynth
fmt
fontconfig
fprintd
frameworkintegration
freeglut
freerdp2
freetype2
fribidi
fuse-common
fuse3
gawk
gc
gcc
gcc-libs
gcc13
gcc13-libs
gdb
gdb-common
gdbm
gdk-pixbuf2
gettext
giflib
git
github-cli
glib-networking
glib2
glibc
glibmm
glslang
glu
gmp
gnome-desktop
gnome-desktop-common
gnulib-l10n
gnupg
gnutls
go
gobject-introspection-runtime
gperftools
gpgme
gpm
graphene
graphite
grep
grim
groff
grub
grub-customizer
gsettings-desktop-schemas
gsettings-system-schemas
gsm
gsound
gssdp
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gst-plugins-good
gst-plugins-ugly
gstreamer
gstreamer-vaapi
gtest
gtk-layer-shell
gtk-update-icon-cache
gtk3
gtk4
gtkmm3
guile
gupnp
gupnp-igd
gzip
harfbuzz
harfbuzz-icu
hdparm
hicolor-icon-theme
hidapi
highway
hiredis
htop
http-parser
hunspell
hwdata
hyphen
hyprcursor
hyprgraphics
hyprland
hyprland-qt-support
hyprland-qtutils
hyprlang
hyprlock
hyprpaper
hyprutils
hyprwayland-scanner
i2c-tools
iana-etc
icu
imagemagick
imath
imlib2
imv
iproute2
iptables
iputils
iso-codes
iw
jansson
java-environment-common
java-runtime-common
jbigkit
jdk-openjdk
json-c
json-glib
jsoncpp
kaccounts-integration
kactivitymanagerd
karchive
kauth
kbd
kbookmarks
kcmutils
kcodecs
kcolorscheme
kcompletion
kconfig
kconfigwidgets
kcoreaddons
kcrash
kdbusaddons
kde-cli-tools
kde-gtk-config
kdeclarative
kdecoration
kded
kdeplasma-addons
kdesu
kdnssd
kdsoap-qt6
kdsoap-ws-discovery-client
keyutils
kfilemetadata
kgamma
kglobalaccel
kglobalacceld
kguiaddons
kholidays
ki18n
kiconthemes
kidletime
kinfocenter
kio
kio-extras
kio-fuse
kirigami
kirigami-addons
kitemmodels
kitemviews
kitty
kitty-shell-integration
kitty-terminfo
kjobwidgets
kmenuedit
kmod
knewstuff
knotifications
knotifyconfig
kpackage
kparts
kpipewire
kpty
kquickcharts
krb5
krdp
krunner
kscreen
kscreenlocker
kservice
ksshaskpass
kstatusnotifieritem
ksvg
ksystemstats
ktexteditor
ktextwidgets
kunitconversion
kuserfeedback
kwallet
kwallet-pam
kwayland
kwidgetsaddons
kwin
kwindowsystem
kwrited
kxmlgui
l-smash
lame
layer-shell-qt
lazygit
lcms2
ldb
less
lib32-acl
lib32-alsa-lib
lib32-alsa-plugins
lib32-attr
lib32-brotli
lib32-bzip2
lib32-curl
lib32-dbus
lib32-e2fsprogs
lib32-expat
lib32-flac
lib32-fontconfig
lib32-freetype2
lib32-gcc-libs
lib32-gettext
lib32-glib2
lib32-glibc
lib32-harfbuzz
lib32-icu
lib32-json-c
lib32-keyutils
lib32-krb5
lib32-libasyncns
lib32-libcap
lib32-libdrm
lib32-libelf
lib32-libffi
lib32-libgcrypt
lib32-libglvnd
lib32-libgpg-error
lib32-libidn2
lib32-libldap
lib32-libnghttp2
lib32-libnghttp3
lib32-libnl
lib32-libnsl
lib32-libogg
lib32-libpcap
lib32-libpciaccess
lib32-libpipewire
lib32-libpng
lib32-libpsl
lib32-libpulse
lib32-libsndfile
lib32-libssh2
lib32-libtasn1
lib32-libtirpc
lib32-libunistring
lib32-libvorbis
lib32-libx11
lib32-libxau
lib32-libxcb
lib32-libxcrypt
lib32-libxcrypt-compat
lib32-libxcursor
lib32-libxdmcp
lib32-libxext
lib32-libxfixes
lib32-libxi
lib32-libxml2
lib32-libxrandr
lib32-libxrender
lib32-libxshmfence
lib32-libxss
lib32-libxxf86vm
lib32-llvm-libs
lib32-lm_sensors
lib32-mesa
lib32-ncurses
lib32-nspr
lib32-nss
lib32-openssl
lib32-opus
lib32-p11-kit
lib32-pam
lib32-pcre2
lib32-pipewire
lib32-spirv-tools
lib32-sqlite
lib32-systemd
lib32-util-linux
lib32-vulkan-icd-loader
lib32-vulkan-radeon
lib32-wayland
lib32-xcb-util-keysyms
lib32-xz
lib32-zlib
lib32-zstd
libabw
libaccounts-glib
libaccounts-qt
libadwaita
libarchive
libass
libassuan
libasyncns
libatasmart
libatomic_ops
libavc1394
libavif
libavtp
libb2
libblockdev
libblockdev-crypto
libblockdev-fs
libblockdev-loop
libblockdev-mdraid
libblockdev-nvme
libblockdev-part
libblockdev-swap
libbluray
libbpf
libbs2b
libbsd
libbytesize
libc++
libc++abi
libcaca
libcanberra
libcap
libcap-ng
libcdio
libcdio-paranoia
libcdr
libcloudproviders
libcmis
libcolord
libcups
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdc1394
libdca
libde265
libdecor
libdeflate
libdisplay-info
libdmtx
libdovi
libdrm
libdv
libdvbpsi
libdvdnav
libdvdread
libe-book
libebml
libedit
libei
libelf
libepoxy
libepubgen
libetonyek
libevdev
libevent
libexif
libexttextcat
libfdk-aac
libffi
libfontenc
libfprint
libfreeaptx
libfreehand
libgcrypt
libgirepository
libgit2
libglvnd
libgme
libgpg-error
libgtop
libgudev
libgusb
libheif
libice
libidn
libidn2
libiec61883
libimagequant
libimobiledevice
libimobiledevice-glue
libinih
libinput
libinstpatch
libisl
libixion
libjpeg-turbo
libjxl
libkexiv2
libksba
libkscreen
libksysguard
liblangtag
liblc3
libldac
libldap
libliftoff
liblqr
liblrdf
libltc
libluv
libmad
libmalcontent
libmanette
libmatroska
libmbim
libmd
libmfx
libmicrodns
libmm-glib
libmnl
libmodplug
libmpc
libmpcdec
libmpdclient
libmpeg2
libmspub
libmtp
libmwaw
libmysofa
libndp
libnet
libnetfilter_conntrack
libnewt
libnfnetlink
libnftnl
libnghttp2
libnghttp3
libngtcp2
libnice
libnl
libnm
libnotify
libnsl
libnumbertext
libnvme
libodfgen
libogg
libopenmpt
liborcus
libp11-kit
libpagemaker
libpcap
libpciaccess
libpgm
libpipeline
libpipewire
libplacebo
libplasma
libplist
libpng
libproxy
libpsl
libpulse
libqaccessibilityclient-qt6
libqalculate
libqmi
libqrtr-glib
libqxp
libraqm
libraw1394
libreoffice-still
librevenge
librsvg
librsync
libsamplerate
libsasl
libseccomp
libsecret
libshout
libsigc++
libsixel
libsm
libsndfile
libsodium
libsoup3
libsoxr
libsrtp
libssh
libssh2
libstaroffice
libstemmer
libsysprof-capture
libtar
libtasn1
libteam
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libunibreak
libunistring
libunwind
libupnp
liburing
libusb
libusbmuxd
libutempter
libutf8proc
libuv
libva
libvdpau
libverto
libvisio
libvlc
libvorbis
libvpl
libvpx
libvterm
libwacom
libwbclient
libwebp
libwireplumber
libwpd
libwps
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcrypt-compat
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfce4ui
libxfce4util
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxmlb
libxmu
libxpm
libxpresent
libxrandr
libxrender
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libyuv
libzip
libzmf
licenses
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-whence
lld
lldb
llvm
llvm-libs
lm_sensors
lmdb
lpsolve
lsb-release
lsof
lua
lua51-lpeg
luajit
lutris
lv2
lz4
lzo
m4
mailcap
make
mako
man-db
man-pages
md4c
mdadm
media-player-info
mesa
mesa-utils
meson
milou
minizip
mjpegtools
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
modemmanager
modemmanager-qt
mpdecimal
mpfr
mpg123
mpv
msgpack-c
mtdev
mujs
nasm
ncurses
neon
neovim
netstandard-targeting-pack
nettle
networkmanager
networkmanager-openvpn
networkmanager-qt
nftables
ninja
node-gyp
nodejs
nodejs-nopt
noto-fonts
noto-fonts-emoji
npm
npth
nspr
nss
ocean-sound-theme
ocl-icd
oniguruma
openal
opencl-headers
opencl-nvidia
opencore-amr
openexr
openh264
openjdk-doc
openjpeg2
openmp
openssh
openssl
openvpn
openxr
opus
orc
os-prober
ostree
otf-hasklig-nerd
oxygen
oxygen-sounds
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pam
pambase
pango
pangomm
parallel
parted
patch
pciutils
pcre
pcre2
pcsclite
perl
perl-error
perl-mailtools
perl-timedate
phonon-qt6
phonon-qt6-vlc
pinentry
pipewire
pipewire-audio
pipewire-jack
pipewire-pulse
pixman
pkcs11-helper
pkgconf
plasma-activities
plasma-activities-stats
plasma-browser-integration
plasma-desktop
plasma-disks
plasma-firewall
plasma-integration
plasma-nm
plasma-pa
plasma-sdk
plasma-systemmonitor
plasma-thunderbolt
plasma-vault
plasma-welcome
plasma-workspace
plasma-workspace-wallpapers
plasma5support
playerctl
plymouth
plymouth-kcm
polkit
polkit-kde-agent
polkit-qt6
poppler
poppler-qt6
popt
portaudio
powerdevil
ppp
print-manager
prison
procps-ng
psmisc
pugixml
pulse-native-provider
pulseaudio-qt
purpose
python
python-argcomplete
python-attrs
python-bcrypt
python-beautifulsoup4
python-cairo
python-certifi
python-cffi
python-charset-normalizer
python-click
python-cryptography
python-dbus
python-distlib
python-distro
python-evdev
python-filelock
python-gobject
python-idna
python-jinja
python-lxml
python-markupsafe
python-moddb
python-packaging
python-paramiko
python-pillow
python-pip
python-pipx
python-platformdirs
python-psutil
python-pycparser
python-pygdbmi
python-pynacl
python-requests
python-resolvelib
python-sentry_sdk
python-soupsieve
python-tqdm
python-typing_extensions
python-urllib3
python-userpath
python-virtualenv
python-wheel
python-yaml
qca-qt6
qcoro
qqc2-breeze-style
qqc2-desktop-style
qrencode
qt5-base
qt5-declarative
qt5-quickcontrols2
qt5-svg
qt5-translations
qt5-x11extras
qt6-5compat
qt6-base
qt6-declarative
qt6-multimedia
qt6-multimedia-gstreamer
qt6-positioning
qt6-quick3d
qt6-quicktimeline
qt6-sensors
qt6-shadertools
qt6-speech
qt6-svg
qt6-tools
qt6-translations
qt6-virtualkeyboard
qt6-wayland
qt6-webchannel
qt6-webengine
qt6-websockets
qt6-webview
qtkeychain-qt6
radeontop
raptor
rasqal
rav1e
re2
readline
redland
redshift
rhash
ripgrep
ripgrep-all
rsync
rtkit
rtmpdump
rubberband
run-parts
sbc
sdbus-cpp
sddm
sddm-kcm
sdl2
seatd
sed
semver
serd
shaderc
shadow
shared-mime-info
signon-kwallet-extension
signon-plugin-oauth2
signon-ui
signond
slang
slurp
smartmontools
smbclient
snappy
sndio
socat
sof-firmware
solid
sonnet
sord
sound-theme-freedesktop
soundtouch
source-highlight
spandsp
spdlog
speex
speexdsp
spirv-tools
sqlite
sratom
srt
sshfs
startup-notification
steam
stow
sudo
svt-av1
svt-hevc
syndication
syntax-highlighting
systemd
systemd-libs
systemd-sysvcompat
systemsettings
taglib
talloc
tar
tdb
terminus-font
tevent
texinfo
thunar
thunderbird
tinysparql
tlp
tomlplusplus
tpm2-tss
tree
tree-sitter
tree-sitter-c
tree-sitter-cli
tree-sitter-lua
tree-sitter-markdown
tree-sitter-query
tree-sitter-vim
tree-sitter-vimdoc
tslib
ttf-firacode-nerd
ttf-hack
ttf-iosevka-nerd
ttf-jetbrains-mono-nerd
twolame
tzdata
uchardet
udisks2
ufw
unibilium
unzip
upower
usbutils
util-linux
util-linux-libs
v4l-utils
vapoursynth
vid.stab
vim
vim-runtime
vkd3d
vlc
vmaf
volume_key
vulkan-headers
vulkan-icd-loader
vulkan-radeon
vulkan-tools
wacomtablet
wavpack
waybar
wayland
wayland-protocols
wayland-utils
webkit2gtk-4.1
webrtc-audio-processing-1
wget
which
wildmidi
wine-mono
wine-staging
winetricks
wireplumber
wl-clipboard
wob
woff2
wofi
wpa_supplicant
x264
x265
xcb-imdkit
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-errors
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xdg-dbus-proxy
xdg-desktop-portal
xdg-desktop-portal-kde
xdg-user-dirs
xdg-utils
xf86-input-libinput
xf86-input-wacom
xfconf
xkeyboard-config
xmlsec
xorg-fonts-encodings
xorg-server
xorg-server-common
xorg-setxkbmap
xorg-xauth
xorg-xdpyinfo
xorg-xhost
xorg-xkbcomp
xorg-xmessage
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xset
xorg-xsetroot
xorg-xwayland
xorgproto
xsettingsd
xvidcore
xxhash
xz
yaml-cpp
yyjson
zbar
zenity
zeromq
zimg
zix
zlib
zsh
zsh-syntax-highlighting
zstd
zvbi
zxing-cpp
