7zip
aarch64-linux-gnu-binutils
aarch64-linux-gnu-gcc
aarch64-linux-gnu-gdb
acpi
alsa-utils
amd-ucode
android-file-transfer
android-tools
anki
arch-wiki-docs
arch-wiki-lite
base
base-devel
bash-completion
bat
bat-extras
bc
bear
biber
bind
blueman
bluez-utils
bolt
bottom
brightnessctl
ca-certificates
catppuccin-cursors-mocha
catppuccin-mocha-grub-theme-git
catppuccin-sddm-theme-mocha
cava
ccache
chaotic-keyring
chaotic-mirrorlist
chrony
clang
cmake
cmatrix
colloid-catppuccin-theme-git
conan
cowsay
cpio
cppman
cppreference
cronie
darkman
dict-freedict-deu-eng-bin
dict-freedict-eng-deu-bin
dictd
docker
docker-buildx
docker-compose
docs-gl
doxygen
easy-rsa
easyeffects
efibootmgr
espeak-ng
ethtool
eza
fasm
fast_float
fastfetch
fcitx5-bamboo
fcitx5-configtool
fcitx5-gtk
fd
firefox
firefoxpwa
fish
fisher
fprintd
francis
freetube
fwupd
fzf
gamemode
gcc
gcovr
gf2-git
gimp
git
git-delta
git-lfs
github-cli
glad
gnu-netcat
gnuplot
gnuplot-demos
go
goldendict-ng
graphviz
grim
grub
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-base
gst-plugins-good
gst-plugins-ugly
gstreamer
gstreamer-docs
gstreamer-vaapi
gvfs-dnssd
hdf5
helix
hyprland
hyprlock
hyprpaper
hyprpicker
hyprpolkitagent
hyprsunset
ifplugd
ifuse
imv
inetutils
inkscape
iperf3
iwd
jdk-openjdk
jdtls
joplin-beta
jq
kdeconnect
kid3
kitty
krita
kvantum
lazydocker
lazygit
lcov
lib32-gamemode
lib32-gst-plugins-base
lib32-gst-plugins-base-libs
lib32-gst-plugins-good
lib32-gstreamer
lib32-libpulse
lib32-pipewire
lib32-vkd3d
libc++
libevent-docs
libjxl
libmpeg2
libreoffice-still
libsrtp-docs
libvirt
linux
linux-firmware
linux-headers
lld
lldb
llvm
lsfg-vk-git
lsp-plugins
lua-language-server
luarocks
lutris
mako
man-db
man-pages
mangohud
merkuro
meson
mkcert
mold
mpc
mpd
mpd-mpris
mpv
musescore
nasm
ncmpcpp
ncspot
nemo
neovide
neovim
net-tools
networkmanager
newsboat
nftables
nginx
ninja
nix
nmap
nodejs
npm
ntfs-3g
nwg-displays
nwg-look
obs-studio
opencl-headers
opencv-docs
openjdk-doc
openmp
openresolv
openrgb
openssh
os-prober
otf-comicshanns-nerd
pacman-contrib
pandoc-cli
parallel
pavucontrol
perf
plymouth
prettier
prismlauncher
procs
pulse-native-provider
python
python-croniter
python-docs
python-pip
python-pipx
python-virtualenv
qbittorrent
qemu-full
qpdf
qt5-quickcontrols2
qt5-wayland
qt5ct
qt6ct
racket
radeontop
rate-mirrors
rate-mirrors-debug
raylib
renderdoc
ripgrep-all
rlwrap
rmpc
rocm-core
rofi
rose-pine-hyprcursor
rsync
samba
sccache
scx-scheds
sdcv
slurp
sof-firmware
speech-dispatcher
spicetify-cli
spotify
sshfs
steam
stow
strace
stylua
sudo
tcpdump
terminus-font
termshark
texinfo
texlive-basic
texlive-bibtexextra
texlive-binextra
texlive-context
texlive-fontsextra
texlive-fontsrecommended
texlive-fontutils
texlive-formatsextra
texlive-games
texlive-humanities
texlive-latex
texlive-latexextra
texlive-latexrecommended
texlive-luatex
texlive-mathscience
texlive-metapost
texlive-music
texlive-pictures
texlive-plaingeneric
texlive-pstricks
texlive-publishers
texlive-xetex
thinkfan
thunderbird
tldr
tlp
tlpui
traceroute
tree
tree-sitter-cli
ttf-firacode-nerd
ttf-iosevka-nerd
ttf-jetbrains-mono-nerd
ttf-nerd-fonts-symbols-mono
ttf-noto-nerd
typst
ueberzugpp
ufw
unrar
uwsm
vesktop
vkd3d
vtk
vulkan-radeon
vulkan-tools
wacomtablet
waybar
wayland
wget
wine
wine-gecko
wine-mono
winetricks
wireguard-tools
wireplumber
wireshark-qt
wl-clipboard
wob
x265
xdg-desktop-portal-gtk
xdg-desktop-portal-hyprland
xorg-xhost
xorg-xwayland
xournalpp
yay
yay-debug
yazi
zathura
zathura-pdf-mupdf
