7zip
a52dec
aalib
aarch64-linux-gnu-binutils
aarch64-linux-gnu-gcc
aarch64-linux-gnu-gdb
aarch64-linux-gnu-glibc
aarch64-linux-gnu-linux-api-headers
abseil-cpp
acl
adwaita-cursors
adwaita-fonts
adwaita-icon-theme
adwaita-icon-theme-legacy
aha
alsa-card-profiles
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
alsa-utils
amd-ucode
android-file-transfer
android-udev
aom
appstream
appstream-glib
aquamarine
archlinux-keyring
argon2
aribb24
at-spi2-core
atkmm
attr
audit
autoconf
automake
avahi
avisynthplus
base
base-devel
bash
bash-completion
bat
bat-extras
bc
bear
biber
binutils
bison
blas
blueman
bluez
bluez-libs
bluez-utils
bob
bolt
boost-libs
botan2
bottom
brightnessctl
brltty
brotli
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cabextract
cairo
cairomm
capstone
cargo-flamegraph
catppuccin-cursors-mocha
cava
cblas
ccache
cdparanoia
cfitsio
chafa
chaotic-keyring
chaotic-mirrorlist
chromaprint
chromium
chrony
clang
clinfo
clucene
cmake
cmatrix
code
codec2
compiler-rt
composefs
containerd
coreutils
cowsay
cpio
cppdap
cronie
cryptsetup
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-glib
dconf
debugedit
default-cursors
desktop-file-utils
device-mapper
diffutils
dmidecode
docker
dotconf
double-conversion
doxygen
dtc
duktape
dvisvgm
e2fsprogs
edk2-aarch64
edk2-arm
edk2-ovmf
efibootmgr
efivar
electron34
elfutils
enchant
ethtool
exo
expat
eza
faac
faad2
fakeroot
fasm
fastfetch
fcitx5
fcitx5-bamboo
fcitx5-configtool
fcitx5-gtk
fcitx5-qt
fd
ffcall
ffmpeg
fftw
file
filesystem
findutils
flac
flatpak
flatseal
flex
fluidsynth
fmt
fontconfig
fprintd
freeglut
freetype2
fribidi
fuse-common
fuse2
fuse3
fzf
gawk
gc
gcc
gcc-libs
gcovr
gd
gdb
gdb-common
gdbm
gdk-pixbuf2
gettext
gfxstream
ghc-libs
ghostscript
giflib
girara
git
git-delta
github-cli
gjs
glew
glfw
glib-networking
glib2
glibc
glibmm
glm
glslang
glu
glusterfs
gmime3
gmp
gnome-desktop
gnome-desktop-common
gnulib-l10n
gnupg
gnutls
go
gobject-introspection-runtime
gperftools
gpgme
gpm
graphene
graphite
graphviz
grep
grim
groff
grpc
grub
gsasl
gsettings-desktop-schemas
gsettings-system-schemas
gsfonts
gsm
gssdp
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gst-plugins-good
gst-plugins-ugly
gstreamer
gstreamer-vaapi
gtest
gtk-layer-shell
gtk-update-icon-cache
gtk3
gtk4
gtkmm3
gts
guile
gumbo-parser
gupnp
gupnp-igd
gvim
gzip
harfbuzz
harfbuzz-icu
haskell-base-compat
haskell-case-insensitive
haskell-diff
haskell-ghc-bignum-orphans
haskell-ghc-lib-parser
haskell-gitrev
haskell-hashable
haskell-integer-logarithms
haskell-megaparsec
haskell-memotrie
haskell-newtype-generics
haskell-os-string
haskell-parser-combinators
haskell-primitive
haskell-scientific
hdparm
helix
hicolor-icon-theme
hidapi
highway
hiredis
hunspell
hwdata
hwloc
hyphen
hyprcursor
hyprgraphics
hyprland
hyprland-qt-support
hyprland-qtutils
hyprlang
hyprlock
hyprpaper
hyprpicker
hyprpolkitagent
hyprsunset
hyprutils
hyprwayland-scanner
iana-etc
icu
ifplugd
ijs
imagemagick
imath
imlib2
imv
iniparser
iproute2
iptables
iputils
iso-codes
iw
jansson
java-environment-common
java-runtime-common
jbig2dec
jbigkit
jdk-openjdk
js128
json-c
json-glib
jsoncpp
kbd
kdbusaddons
keyutils
kitemviews
kitty
kitty-shell-integration
kitty-terminfo
kmod
krb5
kwidgetsaddons
kwindowsystem
kyotocabinet
l-smash
lame
lapack
lazydocker
lazygit
lcms2
lcov
leancrypto
leptonica
less
lib32-acl
lib32-alsa-lib
lib32-alsa-plugins
lib32-attr
lib32-audit
lib32-brotli
lib32-bzip2
lib32-curl
lib32-dbus
lib32-e2fsprogs
lib32-expat
lib32-flac
lib32-fontconfig
lib32-freetype2
lib32-gcc-libs
lib32-gettext
lib32-glib2
lib32-glibc
lib32-harfbuzz
lib32-icu
lib32-json-c
lib32-keyutils
lib32-krb5
lib32-libasyncns
lib32-libcap
lib32-libdrm
lib32-libelf
lib32-libffi
lib32-libgcrypt
lib32-libglvnd
lib32-libgpg-error
lib32-libidn2
lib32-libldap
lib32-libnghttp2
lib32-libnghttp3
lib32-libnl
lib32-libnm
lib32-libnsl
lib32-libogg
lib32-libpcap
lib32-libpciaccess
lib32-libpipewire
lib32-libpng
lib32-libpsl
lib32-libpulse
lib32-libsndfile
lib32-libssh2
lib32-libtasn1
lib32-libtirpc
lib32-libunistring
lib32-libva
lib32-libvorbis
lib32-libx11
lib32-libxau
lib32-libxcb
lib32-libxcrypt
lib32-libxcrypt-compat
lib32-libxcursor
lib32-libxdmcp
lib32-libxext
lib32-libxfixes
lib32-libxi
lib32-libxinerama
lib32-libxml2
lib32-libxrandr
lib32-libxrender
lib32-libxshmfence
lib32-libxss
lib32-libxxf86vm
lib32-llvm-libs
lib32-lm_sensors
lib32-mesa
lib32-ncurses
lib32-nspr
lib32-nss
lib32-openssl
lib32-opus
lib32-p11-kit
lib32-pam
lib32-pcre2
lib32-pipewire
lib32-spirv-tools
lib32-sqlite
lib32-systemd
lib32-util-linux
lib32-vulkan-icd-loader
lib32-vulkan-radeon
lib32-wayland
lib32-xcb-util-keysyms
lib32-xz
lib32-zlib
lib32-zstd
libabw
libadwaita
libaemu
libaio
libao
libappindicator-gtk3
libarchive
libass
libassuan
libasyncns
libatasmart
libatomic_ops
libavc1394
libavif
libavtp
libb2
libblake3
libblockdev
libblockdev-crypto
libblockdev-fs
libblockdev-loop
libblockdev-mdraid
libblockdev-nvme
libblockdev-part
libblockdev-swap
libbluray
libbpf
libbs2b
libbsd
libbytesize
libc++
libc++abi
libcaca
libcacard
libcanberra
libcap
libcap-ng
libcbor
libcdio
libcdio-paranoia
libcdr
libcgif
libcloudproviders
libcmis
libcolord
libcups
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdc1394
libdca
libde265
libdecor
libdeflate
libdisplay-info
libdovi
libdrm
libdv
libdvdnav
libdvdread
libe-book
libebur128
libedit
libei
libelf
libepoxy
libepubgen
libetonyek
libevdev
libevent
libexif
libexttextcat
libfdk-aac
libffi
libfontenc
libfprint
libfreeaptx
libfreehand
libgcrypt
libgirepository
libgit2
libglvnd
libgme
libgpg-error
libgtop
libgudev
libgusb
libhandy
libheif
libice
libidn
libidn2
libiec61883
libimagequant
libimobiledevice
libimobiledevice-glue
libinih
libinput
libinstpatch
libiscsi
libisl
libixion
libjpeg-turbo
libjxl
libksba
liblangtag
liblc3
libldac
libldap
libliftoff
liblouis
liblqr
liblrdf
libltc
libluv
libmalcontent
libmanette
libmd
libmicrodns
libmm-glib
libmnl
libmodplug
libmpc
libmpcdec
libmpdclient
libmpeg2
libmspub
libmtp
libmupdf
libmwaw
libmysofa
libnbd
libndp
libnet
libnetfilter_conntrack
libnewt
libnfnetlink
libnfs
libnftnl
libnghttp2
libnghttp3
libngtcp2
libnice
libnl
libnm
libnotify
libnsl
libnumbertext
libnvme
libodfgen
libogg
libopenmpt
liborcus
libp11-kit
libpagemaker
libpaper
libpcap
libpciaccess
libpfm
libpgm
libpipeline
libpipewire
libplacebo
libplist
libpng
libproxy
libpsl
libpulse
libqxp
libraqm
libraw1394
libreoffice-still
librevenge
librsvg
librsync
libsamplerate
libsasl
libseccomp
libsecret
libshout
libsigc++
libsigsegv
libsixel
libslirp
libsm
libsndfile
libsodium
libsoup3
libsoxr
libspeechd
libspng
libsrtp
libssh
libssh2
libstaroffice
libstemmer
libsynctex
libsysprof-capture
libtasn1
libteam
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libtraceevent
libtracefs
libunibreak
libunistring
libunwind
liburcu
liburing
libusb
libusbmuxd
libutf8proc
libuv
libva
libvdpau
libverto
libvips
libvirt
libvisio
libvorbis
libvpl
libvpx
libvterm
libwacom
libwebp
libwireplumber
libwpd
libwps
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcrypt-compat
libxcursor
libxcvt
libxdamage
libxdmcp
libxdp
libxext
libxfce4ui
libxfce4util
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxmlb
libxmu
libxpm
libxpresent
libxrandr
libxrender
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libyuv
libzip
libzmf
licenses
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-whence
lld
lldb
llhttp
llvm
llvm-libs
lm_sensors
lmdb
lpsolve
lsb-release
lsof
lua
lua51-lpeg
luajit
luarocks
lutris
lv2
lz4
lzo
m4
mailcap
make
mako
man-db
man-pages
mangohud
mbedtls2
md4c
mdadm
mesa
mesa-utils
meson
mimalloc
minizip
mjpegtools
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
mold
mpdecimal
mpfr
mpg123
mpv
msgpack-c
msmtp
msmtp-mta
mtdev
mujs
multipath-tools
nasm
ncspot
ncurses
ndctl
neon
neovide
neovim
net-tools
netpbm
nettle
networkmanager
nftables
ninja
nlohmann-json
nmap
node-gyp
nodejs
nodejs-nopt
noto-fonts
npm
npth
nspr
nss
numactl
nushell
ocl-icd
onetbb
oniguruma
openal
opencl-headers
opencore-amr
opencv
openexr
openh264
openjdk-doc
openjpeg2
openmp
openrgb
openssh
openssl
opus
orc
os-prober
ostree
otf-comicshanns-nerd
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pam
pambase
pango
pangomm
parallel
parted
pass
patch
pciutils
pcre
pcre2
pcsclite
perf
perl
perl-alien-build
perl-alien-libxml2
perl-autovivification
perl-b-hooks-endofscope
perl-business-isbn
perl-business-isbn-data
perl-business-ismn
perl-business-issn
perl-capture-tiny
perl-class-accessor
perl-class-data-inheritable
perl-class-inspector
perl-class-load
perl-class-singleton
perl-clone
perl-data-compare
perl-data-dump
perl-data-optlist
perl-data-uniqid
perl-datetime
perl-datetime-calendar-julian
perl-datetime-format-builder
perl-datetime-format-strptime
perl-datetime-locale
perl-datetime-timezone
perl-devel-cover
perl-devel-stacktrace
perl-dist-checkconflicts
perl-encode-locale
perl-error
perl-eval-closure
perl-exception-class
perl-exporter-tiny
perl-ffi-checklib
perl-file-chdir
perl-file-find-rule
perl-file-listing
perl-file-sharedir
perl-file-sharedir-install
perl-file-slurp-tiny
perl-file-slurper
perl-file-which
perl-html-parser
perl-html-tagset
perl-http-cookiejar
perl-http-cookies
perl-http-daemon
perl-http-date
perl-http-message
perl-http-negotiate
perl-io-html
perl-io-socket-ssl
perl-io-string
perl-ipc-run3
perl-libwww
perl-lingua-translit
perl-list-allutils
perl-list-moreutils
perl-list-moreutils-xs
perl-list-someutils
perl-list-utilsby
perl-log-log4perl
perl-lwp-mediatypes
perl-lwp-protocol-https
perl-mailtools
perl-math-round
perl-memory-process
perl-memory-usage
perl-mime-charset
perl-module-implementation
perl-module-runtime
perl-mozilla-ca
perl-mro-compat
perl-namespace-autoclean
perl-namespace-clean
perl-net-http
perl-net-ssleay
perl-number-compare
perl-package-deprecationmanager
perl-package-stash
perl-package-stash-xs
perl-params-util
perl-params-validate
perl-params-validationcompiler
perl-parse-recdescent
perl-path-tiny
perl-perlio-utf8-strict
perl-readonly
perl-regexp-common
perl-role-tiny
perl-sort-key
perl-specio
perl-sub-exporter
perl-sub-exporter-progressive
perl-sub-install
perl-test-fatal
perl-text-bibtex
perl-text-csv
perl-text-glob
perl-text-roman
perl-tie-cycle
perl-timedate
perl-try-tiny
perl-unicode-linebreak
perl-uri
perl-variable-magic
perl-www-robotrules
perl-xml-libxml
perl-xml-libxml-simple
perl-xml-libxslt
perl-xml-namespacesupport
perl-xml-sax
perl-xml-sax-base
perl-xml-writer
pinentry
pipewire
pipewire-audio
pipewire-jack
pipewire-pulse
pixman
pkgconf
playerctl
polkit
polkit-qt6
poppler
poppler-data
popt
portaudio
potrace
procps-ng
procs
protobuf
psmisc
pugixml
pulse-native-provider
python
python-argcomplete
python-attrs
python-babel
python-beautifulsoup4
python-bottle
python-cairo
python-certifi
python-cffi
python-charset-normalizer
python-click
python-colorama
python-colorlog
python-contourpy
python-croniter
python-cryptography
python-cycler
python-dateutil
python-dbus
python-distlib
python-distro
python-evdev
python-fasteners
python-filelock
python-fonttools
python-gobject
python-html5lib
python-idna
python-jinja
python-kiwisolver
python-lxml
python-markupsafe
python-matplotlib
python-moddb
python-numpy
python-packaging
python-pillow
python-pip
python-pipx
python-platformdirs
python-pycparser
python-pygments
python-pyjwt
python-pyparsing
python-pytz
python-pyxdg
python-requests
python-shtab
python-six
python-soupsieve
python-termcolor
python-tqdm
python-typing_extensions
python-urllib3
python-userpath
python-virtualenv
python-webencodings
python-wheel
python-xlib
python-yaml
qemu-audio-alsa
qemu-audio-dbus
qemu-audio-jack
qemu-audio-oss
qemu-audio-pa
qemu-audio-pipewire
qemu-audio-sdl
qemu-audio-spice
qemu-base
qemu-block-curl
qemu-block-dmg
qemu-block-gluster
qemu-block-iscsi
qemu-block-nfs
qemu-block-ssh
qemu-chardev-baum
qemu-chardev-spice
qemu-common
qemu-desktop
qemu-docs
qemu-emulators-full
qemu-full
qemu-hw-display-qxl
qemu-hw-display-virtio-gpu
qemu-hw-display-virtio-gpu-gl
qemu-hw-display-virtio-gpu-pci
qemu-hw-display-virtio-gpu-pci-gl
qemu-hw-display-virtio-gpu-pci-rutabaga
qemu-hw-display-virtio-gpu-rutabaga
qemu-hw-display-virtio-vga
qemu-hw-display-virtio-vga-gl
qemu-hw-display-virtio-vga-rutabaga
qemu-hw-s390x-virtio-gpu-ccw
qemu-hw-uefi-vars
qemu-hw-usb-host
qemu-hw-usb-redirect
qemu-hw-usb-smartcard
qemu-img
qemu-pr-helper
qemu-system-aarch64
qemu-system-alpha
qemu-system-alpha-firmware
qemu-system-arm
qemu-system-arm-firmware
qemu-system-avr
qemu-system-hppa
qemu-system-hppa-firmware
qemu-system-loongarch64
qemu-system-m68k
qemu-system-microblaze
qemu-system-microblaze-firmware
qemu-system-mips
qemu-system-or1k
qemu-system-ppc
qemu-system-ppc-firmware
qemu-system-riscv
qemu-system-riscv-firmware
qemu-system-rx
qemu-system-s390x
qemu-system-s390x-firmware
qemu-system-sh4
qemu-system-sparc
qemu-system-sparc-firmware
qemu-system-tricore
qemu-system-x86
qemu-system-x86-firmware
qemu-system-xtensa
qemu-tests
qemu-tools
qemu-ui-curses
qemu-ui-dbus
qemu-ui-egl-headless
qemu-ui-gtk
qemu-ui-opengl
qemu-ui-sdl
qemu-ui-spice-app
qemu-ui-spice-core
qemu-user
qemu-vhost-user-gpu
qemu-vmsr-helper
qhull
qrencode
qt5-base
qt5-declarative
qt5-quickcontrols2
qt5-translations
qt6-base
qt6-declarative
qt6-svg
qt6-translations
qt6-wayland
racket
raptor
rasqal
rate-mirrors
rav1e
re2
readline
redland
redshift
rhash
ripgrep
rofi-wayland
rpcbind
rtkit
rtmpdump
rubberband
run-parts
runc
rustup
rutabaga-ffi
sbc
sccache
sdbus-cpp
sddm
sdl2-compat
sdl2_image
sdl3
seabios
seatd
sed
semver
serd
sfsexp
shaderc
shadow
shared-mime-info
silicon
simdjson
slang
slurp
snappy
sndio
sof-firmware
sord
sound-theme-freedesktop
soundtouch
source-highlight
spandsp
spdlog
speech-dispatcher
speex
speexdsp
spice
spice-protocol
spirv-tools
sqlite
sratom
srt
sshfs
startup-notification
steam
stow
strace
sudo
svt-av1
svt-hevc
systemd
systemd-libs
systemd-sysvcompat
taglib
tar
tdb
terminus-font
tesseract
tesseract-data-eng
tesseract-data-osd
texinfo
texlive-basic
texlive-bibtexextra
texlive-bin
texlive-binextra
texlive-context
texlive-fontsextra
texlive-fontsrecommended
texlive-fontutils
texlive-formatsextra
texlive-games
texlive-humanities
texlive-latex
texlive-latexextra
texlive-latexrecommended
texlive-luatex
texlive-mathscience
texlive-metapost
texlive-music
texlive-pictures
texlive-plaingeneric
texlive-pstricks
texlive-publishers
texlive-xetex
thunar
thunderbird
tinysparql
tldr
tlp
tokei
tomlplusplus
tpm2-tss
tree
tree-sitter
tree-sitter-c
tree-sitter-cli
tree-sitter-lua
tree-sitter-markdown
tree-sitter-query
tree-sitter-vim
tree-sitter-vimdoc
tslib
ttf-firacode-nerd
ttf-iosevka-nerd
ttf-jetbrains-mono-nerd
ttf-liberation
ttf-ms-fonts
ttf-nerd-fonts-symbols
ttf-nerd-fonts-symbols-common
ttf-nerd-fonts-symbols-mono
ttf-noto-nerd
twolame
tzdata
uchardet
udisks2
ueberzugpp
ufw
unibilium
unzip
upower
usbimager
usbredir
usbutils
util-linux
util-linux-libs
uwsm
v4l-utils
vapoursynth
vde2
verdict
vid.stab
vim-runtime
virglrenderer
virtiofsd
vkd3d
vmaf
volume_key
vte-common
vte3
vulkan-icd-loader
vulkan-radeon
vulkan-tools
wavpack
waybar
wayland
wayland-protocols
wayland-utils
webkit2gtk-4.1
webkitgtk-6.0
webrtc-audio-processing-1
wget
which
wildmidi
wine-mono
wine-staging
winetricks
wireplumber
wl-clipboard
wob
woff2
wolfssl
wpa_supplicant
x264
x265
xapian-core
xcb-imdkit
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-errors
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xclip
xdg-dbus-proxy
xdg-desktop-portal
xdg-desktop-portal-gtk
xdg-desktop-portal-hyprland
xdg-user-dirs
xdg-utils
xf86-input-libinput
xfconf
xkeyboard-config
xmlsec
xorg-fonts-encodings
xorg-server
xorg-server-common
xorg-setxkbmap
xorg-xauth
xorg-xdpyinfo
xorg-xhost
xorg-xkbcomp
xorg-xprop
xorg-xrandr
xorg-xset
xorg-xwayland
xorgproto
xvidcore
xxhash
xz
yaml-cpp
yay
yazi
yyjson
zathura
zathura-pdf-mupdf
zbar
zenity
zeromq
zimg
zip
zix
zlib
zlib-ng
zsh
zsh-completions
zsh-syntax-highlighting
zstd
zvbi
zxing-cpp
zziplib
